hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_spim.h
    @param[in] p_reg            Pointer to the peripheral registers structure.
    @param[in] spim_shorts_mask Shortcuts to enable.
*/
__STATIC_INLINE void nrf_spim_shorts_enable(NRF_SPIM_Type *p_reg,
                                            uint32_t spim_shorts_mask);
                                            
/**
    @brief Function for disabling specified shortcuts.

    @param[in] p_reg            Pointer to the peripheral registers structure.
    @param[in] spim_shorts_mask Shortcuts to disable.
*/
__STATIC_INLINE void nrf_spim_shorts_disable(NRF_SPIM_Type *p_reg,
                                             uint32_t spim_shorts_mask);
                                             
/**
    @brief Function for getting shorts setting.

    @param[in] p_reg           Pointer to the peripheral registers structure.
*/
__STATIC_INLINE uint32_t nrf_spim_shorts_get(NRF_SPIM_Type *p_reg);

/**
    @brief Function for enabling specified interrupts.

    @param[in] p_reg        Pointer to the peripheral registers structure.
    @param[in] spim_int_mask Interrupts to enable.
*/
__STATIC_INLINE void nrf_spim_int_enable(NRF_SPIM_Type *p_reg,
                                         uint32_t spim_int_mask);
                                         
/**
    @brief Function for disabling specified interrupts.

    @param[in] p_reg        Pointer to the peripheral registers structure.
    @param[in] spim_int_mask Interrupts to disable.
*/
__STATIC_INLINE void nrf_spim_int_disable(NRF_SPIM_Type *p_reg,
                                          uint32_t spim_int_mask);
                                          
/**
    @brief Function for retrieving the state of a given interrupt.

    @param[in] p_reg   Pointer to the peripheral registers structure.
    @param[in] spim_int Interrupt to check.

    @retval true  If the interrupt is enabled.
    @retval false If the interrupt is not enabled.
*/
__STATIC_INLINE bool nrf_spim_int_enable_check(NRF_SPIM_Type *p_reg,
                                               nrf_spim_int_mask_t spim_int);
                                               
/**
    @brief Function for enabling the SPIM peripheral.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_enable(NRF_SPIM_Type *p_reg);

/**
    @brief Function for disabling the SPIM peripheral.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_disable(NRF_SPIM_Type *p_reg);

/**
    @brief Function for configuring SPIM pins.

    If a given signal is not needed, pass the @ref NRF_SPIM_PIN_NOT_CONNECTED
    value instead of its pin number.

    @param[in] p_reg    Pointer to the peripheral registers structure.
    @param[in] sck_pin  SCK pin number.
    @param[in] mosi_pin MOSI pin number.
    @param[in] miso_pin MISO pin number.
*/
__STATIC_INLINE void nrf_spim_pins_set(NRF_SPIM_Type *p_reg,
                                       uint32_t sck_pin,
                                       uint32_t mosi_pin,
                                       uint32_t miso_pin);
                                       
#if (NRF_SPIM_HW_CSN_PRESENT) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for configuring the SPIM hardware CSN pin.

    If this signal is not needed, pass the @ref NRF_SPIM_PIN_NOT_CONNECTED
    value instead of its pin number.

    @param[in] p_reg    Pointer to the peripheral registers structure.
    @param[in] pin      CSN pin number.
    @param[in] polarity CSN pin polarity.
    @param[in] duration Minimum duration between the edge of CSN and the edge of SCK
                       and minimum duration of CSN must stay unselected between transactions.
                       The value is specified in number of 64 MHz clock cycles (15.625 ns).
*/
__STATIC_INLINE void nrf_spim_csn_configure(NRF_SPIM_Type *p_reg,
                                            uint32_t pin,
                                            nrf_spim_csn_pol_t polarity,
                                            uint32_t duration);
#endif // (NRF_SPIM_HW_CSN_PRESENT) || defined(__NRFX_DOXYGEN__)
                                            
#if defined(SPIM_PSELDCX_CONNECT_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for configuring the SPIM DCX pin.

    If this signal is not needed, pass the @ref NRF_SPIM_PIN_NOT_CONNECTED
    value instead of its pin number.

    @param[in] p_reg   Pointer to the peripheral registers structure.
    @param[in] dcx_pin DCX pin number.
*/
__STATIC_INLINE void nrf_spim_dcx_pin_set(NRF_SPIM_Type *p_reg,
                                          uint32_t dcx_pin);
                                          
/**
    @brief Function for configuring the number of command bytes.

    Maximum value available for dividing the transmitted bytes into command
    bytes and data bytes is @ref NRF_SPIM_DCX_CNT_ALL_CMD - 1.
    The @ref NRF_SPIM_DCX_CNT_ALL_CMD value passed as the @c count parameter
    causes all transmitted bytes to be marked as command bytes.

    @param[in] p_reg Pointer to the peripheral registers structure.
    @param[in] count Number of command bytes preceding the data bytes.
*/
__STATIC_INLINE void nrf_spim_dcx_cnt_set(NRF_SPIM_Type *p_reg,
                                          uint32_t count);
#endif // defined(SPIM_PSELDCX_CONNECT_Msk) || defined(__NRFX_DOXYGEN__)
                                          
#if defined(SPIM_IFTIMING_RXDELAY_RXDELAY_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for configuring the extended SPIM interface.
    @param p_reg   Pointer to the peripheral registers structure.
    @param rxdelay Sample delay for input serial data on MISO,
                  specified in 64 MHz clock cycles (15.625 ns) from the sampling edge of SCK.
*/
__STATIC_INLINE void nrf_spim_iftiming_set(NRF_SPIM_Type *p_reg,
                                           uint32_t rxdelay);
#endif // defined(SPIM_IFTIMING_RXDELAY_RXDELAY_Msk) || defined(__NRFX_DOXYGEN__)
                                           
#if defined(SPIM_STALLSTAT_RX_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for clearing stall status for RX EasyDMA RAM accesses.

    @param p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_stallstat_rx_clear(NRF_SPIM_Type *p_reg);

/**
    @brief Function for getting stall status for RX EasyDMA RAM accesses.

    @param p_reg Pointer to the peripheral registers structure.

    @return Stall status of RX EasyDMA RAM accesses.
*/
__STATIC_INLINE bool nrf_spim_stallstat_rx_get(NRF_SPIM_Type *p_reg);
#endif // defined(SPIM_STALLSTAT_RX_Msk) || defined(__NRFX_DOXYGEN__)

#if defined(SPIM_STALLSTAT_TX_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for clearing stall status for TX EasyDMA RAM accesses.

    @param p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_stallstat_tx_clear(NRF_SPIM_Type *p_reg);

/**
    @brief Function for getting stall status for TX EasyDMA RAM accesses.

    @param p_reg Pointer to the peripheral registers structure.

    @return Stall status of TX EasyDMA RAM accesses.
*/
__STATIC_INLINE bool nrf_spim_stallstat_tx_get(NRF_SPIM_Type *p_reg);
#endif // defined(SPIM_STALLSTAT_TX_Msk) || defined(__NRFX_DOXYGEN__)

/**
    @brief Function for setting the SPI master data rate.

    @param[in] p_reg     Pointer to the peripheral registers structure.
    @param[in] frequency SPI frequency.
*/
__STATIC_INLINE void nrf_spim_frequency_set(NRF_SPIM_Type *p_reg,
                                            nrf_spim_frequency_t frequency);
                                            
/**
    @brief Function for setting the transmit buffer.

    @param[in]  p_reg   Pointer to the peripheral registers structure.
    @param[in]  p_buffer Pointer to the buffer with data to send.
    @param[in]  length   Maximum number of data bytes to transmit.
*/
__STATIC_INLINE void nrf_spim_tx_buffer_set(NRF_SPIM_Type *p_reg,
                                            uint8_t const *p_buffer,
                                            size_t          length);
                                            
/**
    @brief Function for setting the receive buffer.

    @param[in] p_reg   Pointer to the peripheral registers structure.
    @param[in] p_buffer Pointer to the buffer for received data.
    @param[in] length   Maximum number of data bytes to receive.
*/
__STATIC_INLINE void nrf_spim_rx_buffer_set(NRF_SPIM_Type *p_reg,
                                            uint8_t *p_buffer,
                                            size_t    length);
                                            
/**
    @brief Function for setting the SPI configuration.

    @param[in] p_reg        Pointer to the peripheral registers structure.
    @param[in] spi_mode      SPI mode.
    @param[in] spi_bit_order SPI bit order.
*/
__STATIC_INLINE void nrf_spim_configure(NRF_SPIM_Type *p_reg,
                                        nrf_spim_mode_t spi_mode,
                                        nrf_spim_bit_order_t spi_bit_order);
                                        
/**
    @brief Function for setting the over-read character.

    @param[in] p_reg Pointer to the peripheral registers structure.
    @param[in] orc    Over-read character that is clocked out in case of
                     an over-read of the TXD buffer.
*/
__STATIC_INLINE void nrf_spim_orc_set(NRF_SPIM_Type *p_reg,
                                      uint8_t orc);
                                      
/**
    @brief Function for enabling the TX list feature.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_tx_list_enable(NRF_SPIM_Type *p_reg);

/**
    @brief Function for disabling the TX list feature.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_tx_list_disable(NRF_SPIM_Type *p_reg);

/**
    @brief Function for enabling the RX list feature.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_rx_list_enable(NRF_SPIM_Type *p_reg);

/**
    @brief Function for disabling the RX list feature.

    @param[in] p_reg Pointer to the peripheral registers structure.
*/
__STATIC_INLINE void nrf_spim_rx_list_disable(NRF_SPIM_Type *p_reg);

#ifndef SUPPRESS_INLINE_IMPLEMENTATION

__STATIC_INLINE void nrf_spim_task_trigger(NRF_SPIM_Type *p_reg,
                                           nrf_spim_task_t spim_task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)spim_task)) = 0x1UL;
}

__STATIC_INLINE uint32_t nrf_spim_task_address_get(NRF_SPIM_Type *p_reg,
                                                   nrf_spim_task_t spim_task)
{
    return (uint32_t)((uint8_t *)p_reg + (uint32_t)spim_task);
}

__STATIC_INLINE void nrf_spim_event_clear(NRF_SPIM_Type *p_reg,
                                          nrf_spim_event_t spim_event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)spim_event)) = 0x0UL;
    #if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)spim_event));
    (void)dummy;
    #endif
}

__STATIC_INLINE bool nrf_spim_event_check(NRF_SPIM_Type *p_reg,
                                          nrf_spim_event_t spim_event)
{
    return (bool) * (volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)spim_event);
}

